load top50.mat;
type = [1 3 2 2 3 2 1 1 1 2 2 2 2 3 3 3 3 1 1 1 1 1 1 3 3 3 3 3 3 2 2 2 2 2 2 2 3 3 3 3 3 3 3 3 1 1 1 1 1 1];
%我们保证在五年的240周内有90%（216）或95%（228）周能满足生产需求
%首先取前十位的供应商
% A类原料5/3；B类原料50/33；C类原料25/18

A1 = zeros(240);
A = A1(1,:);
for i =1:50
    B = [];
    for j = 1:240
        if type(i)<=1
            B = [B,top50(i,j)*5/3];
        elseif type(i)>=3
            B = [B,top50(i,j)*25/18];
        else
            B = [B,top50(i,j)*50/33];
        end   
    end
    A = A+B;
end
%发现差距还比较大
%接下来需要改变i的变化范围（即取多少周）


sum = 0;
for k = 1:240 
    if A(k)>=28200
        sum = sum+1;
    end
end
if sum>=120 %不一定是这个值，228已经是很苛刻的条件了
    ans = 1
else
    ans = 0
end